benchmarks/results/gin-wrk.txt
Running 30s test @ http://localhost:8800/stocks/AAPL
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    57.77ms   58.87ms 728.70ms   85.57%
    Req/Sec     1.79k   292.23     5.73k    72.97%
  640704 requests in 30.08s, 94.10MB read
Requests/sec:  21299.85
Transfer/sec:      3.13MB