benchmarks/results/gorilla-wrk.txt
Running 30s test @ http://localhost:8900/stocks/AAPL
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.32ms   21.82ms 283.89ms   63.20%
    Req/Sec     3.80k     0.90k    8.26k    74.53%
  1360992 requests in 30.06s, 193.39MB read
Requests/sec:  45275.37
Transfer/sec:      6.43MB