benchmarks/results/gorilla-wrk.txt
Running 30s test @ http://localhost:8900/stocks/AAPL
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.03ms   39.80ms 385.03ms   72.64%
    Req/Sec     2.07k   622.27     5.89k    73.97%
  740888 requests in 30.08s, 105.28MB read
Requests/sec:  24627.66
Transfer/sec:      3.50MB