benchmarks/results/nethttp-wrk.txt
Running 30s test @ http://localhost:8700/stocks/AAPL
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.55ms   19.21ms 188.32ms   59.88%
    Req/Sec     3.55k   739.31     7.46k    76.48%
  1272497 requests in 30.07s, 91.02MB read
Requests/sec:  42323.37
Transfer/sec:      3.03MB